//作者:温柔与海
//搬运请留个名字喔～
//群聊:不想放
//目前王者ID(无符号):我將詩尾续写





































































AddItem("指令:刷","",PluginID);
Toast("温柔与海刷屏\n可到main.java里修改刷屏次数");
public void onMsg(Object msg){
    if(msg.MessageContent.equals("刷")){
        new Thread(new Runnable(){
            public void run(){
                for (int i=0;i < 3;i++) //上面这个3为刷屏次数
                {
                    sendMsg(msg.GroupUin,"","🤣👉🏻🤡\n🤣👉🏻🤡\n🤣👉🏻🤡\n🤣👉🏻🤡\n🤣👉🏻🤡\n🤣👉🏻🤡\n🤣👉🏻🤡\n🤣👉🏻🤡\n🤣👉🏻🤡\n🤣👉🏻🤡\n🤣👉🏻🤡\n🤣👉🏻🤡\n🤣👉🏻🤡\n🤣👉🏻🤡\n🤣👉🏻🤡\n🤣👉🏻🤡\n🤣👉🏻🤡\n🤣👉🏻🤡\n🤣👉🏻🤡\n🤣👉🏻🤡\n🤣👉🏻🤡\n🤣👉🏻🤡\n🤣👉🏻🤡\n🤣👉🏻🤡\n🤣👉🏻🤡\n🤣👉🏻🤡\n🤣👉🏻🤡\n🤣👉🏻🤡\n🤣👉🏻🤡\n🤣👉🏻🤡\n🤣👉🏻🤡\n🤣👉🏻🤡\n🤣👉🏻🤡\n🤣👉🏻🤡\n🤣👉🏻🤡\n🤣👉🏻🤡\n🤣👉🏻🤡\n🤣👉🏻🤡\n🤣👉🏻🤡\n🤣👉🏻🤡\n🤣👉🏻🤡\n🤣👉🏻🤡\n🤣👉🏻🤡\n🤣👉🏻🤡\n🤣👉🏻🤡\n🤣👉🏻🤡\n🤣👉🏻🤡\n🤣👉🏻🤡\n🤣👉🏻🤡\n🤣👉🏻🤡\n🤣👉🏻🤡\n🤣👉🏻🤡\n🤣👉🏻🤡\n🤣👉🏻🤡\n🤣👉🏻🤡\n🤣👉🏻🤡\n🤣👉🏻🤡\n🤣👉🏻🤡\n🤣👉🏻🤡\n🤣👉🏻🤡\n🤣👉🏻🤡\n🤣👉🏻🤡\n🤣👉🏻🤡\n🤣👉🏻🤡\n🤣👉🏻🤡\n🤣👉🏻🤡\n🤣👉🏻🤡\n🤣👉🏻🤡\n🤣👉🏻🤡\n🤣👉🏻🤡\n🤣👉🏻🤡\n🤣👉🏻🤡\n🤣👉🏻🤡\n🤣👉🏻🤡\n🤣👉🏻🤡\n🤣👉🏻🤡\n🤣👉🏻🤡\n🤣👉🏻🤡\n🤣👉🏻🤡\n🤣👉🏻🤡\n🤣👉🏻🤡\n🤣👉🏻🤡\n🤣👉🏻🤡\n🤣👉🏻🤡\n🤣👉🏻🤡\n🤣👉🏻🤡\n🤣👉🏻🤡\n🤣👉🏻🤡\n🤣👉🏻🤡\n🤣👉🏻🤡\n🤣👉🏻🤡\n🤣👉🏻🤡\n🤣👉🏻🤡\n🤣👉🏻🤡\n🤣👉🏻🤡\n🤣👉🏻🤡\n🤣👉🏻🤡\n🤣👉🏻🤡\n🤣👉🏻🤡\n🤣👉🏻🤡\n🤣👉🏻🤡\n🤣👉🏻🤡\n🤣👉🏻🤡\n🤣👉🏻🤡\n🤣👉🏻🤡\n🤣👉🏻🤡\n🤣👉🏻🤡\n🤣👉🏻🤡\n🤣👉🏻🤡\n🤣👉🏻🤡\n🤣👉🏻🤡\n🤣👉🏻🤡\n🤣👉🏻🤡\n🤣👉🏻🤡\n🤣👉🏻🤡\n🤣👉🏻🤡\n🤣👉🏻🤡\n🤣👉🏻🤡\n🤣👉🏻🤡\n🤣👉🏻🤡\n🤣👉🏻🤡\n🤣👉🏻🤡\n🤣👉🏻🤡\n🤣👉🏻🤡\n🤣👉🏻🤡\n🤣👉🏻🤡\n🤣👉🏻🤡\n🤣👉🏻🤡\n🤣👉🏻🤡\n🤣👉🏻🤡\n🤣👉🏻🤡\n🤣👉🏻🤡\n🤣👉🏻🤡\n🤣👉🏻🤡\n🤣👉🏻🤡\n🤣👉🏻🤡\n🤣👉🏻🤡\n🤣👉🏻🤡\n🤣👉🏻🤡\n🤣👉🏻🤡\n🤣👉🏻🤡\n🤣👉🏻🤡\n🤣👉🏻🤡\n🤣👉🏻🤡\n🤣👉🏻🤡\n🤣👉🏻🤡\n🤣👉🏻🤡\n🤣👉🏻🤡\n🤣👉🏻🤡\n🤣👉🏻🤡\n🤣👉🏻🤡\n🤣👉🏻🤡\n🤣👉🏻🤡\n🤣👉🏻🤡\n🤣👉🏻🤡\n🤣👉🏻🤡\n🤣👉🏻🤡\n🤣👉🏻🤡\n🤣👉🏻🤡\n🤣👉🏻🤡\n🤣👉🏻🤡\n🤣👉🏻🤡\n🤣👉🏻🤡\n🤣👉🏻🤡\n🤣👉🏻🤡\n🤣👉🏻🤡\n🤣👉🏻🤡\n🤣👉🏻🤡\n🤣👉🏻🤡\n🤣👉🏻🤡\n🤣👉🏻🤡\n🤣👉🏻🤡");
                    //这个为刷屏内容
                    try{
                        Thread.sleep(300);
                    }catch(InterruptedException e){}
                }
            }
        }).start();
    }
}//取消加载时显示
public void onUnload(){
    Toast("已关闭，期待下次再来");
}sendLike("3468281461",20);

