public void 清屏功能(Object data) {
    String quntext = data.MessageContent;
    String fsz=data.SenderNickName;//发送者的名字
    String qun = data.GroupUin;
    String uin = data.UserUin;
           if ("7".equals(getString(qun, "清屏功能"))){
       if (quntext.equals("清屏"))
       {
       for(int i=0; i<5; i++)
       {
       sendMsg(qun,"","林枫\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n林枫");
       }
       }
       if (quntext.equals("爱腾讯"))
       {
       for(int i=0; i<10; i++)
       {
       sendMsg(qun,"","爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯，爱祖国，爱腾讯");
       }
       }
       }
     }