int atqt=50;//设置艾特人数上限，超过就判断为艾特全体
int 字数=3000;//设置字数上限超过就判断为卡屏
int 个数=6;//进群验证多少位验证码，6就代表6位验证码
int jqyzfz=2;//设置超时进群验证时间,1代表1分钟
int 小号收费=25;//设置小号收费等级
int 解禁次数=2;//每日私聊解禁次数
float 小号收费2=0.5;//设置小号收费金额
String colord1="#F1F1F1";//图片菜单的背景颜色，默认空白
String colord2="";//图片菜单字的颜色，留空为随机
int tqpd=2;//天气是否图文，1为图文,2为文字
int xz2=16;//获取天气的多少天16就是获取16天后的
ArrayList diangekeyword= new ArrayList();
diangekeyword.add("QQ点歌");
diangekeyword.add("点歌");
/*
点歌触发关键词，可复制多加。
英文这里要输入大写。用的时候不区分大小写。
注意
①开头一样的会以前面的为准(比如先设置"点"，又设置"点歌"，点歌xx将会不起作用)
②不要设置数字开头的，
不要设置卡片/链接/语音/发送开头等与选歌或者错误提示冲突的内容(非得设置出了问题本人概不负责)
*/
String textcolor="#FF000000";
//设置文字颜色(格式:#FF5ABDA0),填"随机"随机取色,填错用黑色
int phototype=2;
/*
列表发送为图片时底图的类型
1纯色底图
2本地图片或图片链接(支持随机图片API)
3点出来歌的封面(随机取一个)
*/
String photocolor="#FFF8F2F9";
//设置纯色底图颜色(格式:#FF5ABDA0),填"随机"随机取色",填错用白色
String photourl="https://tuapi.eees.cc/api.php?category=dongman&type=302";
//设置底图图片本地路径或在线链接
int qunsendtype=1;
/*群里点歌发送默认模式(直接发序号那种)，0链接,1卡片,2语音,3文件。4压缩语音
2语音模式会自动缓存音乐到QT语音文件夹，QQ点歌文件夹里。可通过QT语音发送功能手动发送
3文件模式会自动缓存音乐文件到Plugin/QQ点歌/音乐文件夹里
*/